Repository: VictorBrugnago/Compilador
Catalog: AnalisadorLexico/locales/*/LC_MESSAGES/*.po
Languages: pt

source: (transition def) Test Transition --> State: {} | Character: {}
pt: (transition def) Teste Transição --> Estado: {} | Caractere: {}

source: (transition def) Next State: %s
pt: (transition def) Próximo Estado: %s

source: (variable def) Test Variable --> Buffer: %s
pt: (variable def) Teste Variável --> Buffer: %s

source: Nonexistent file
pt: Arquivo inexistente

source: File "{}" Not found!
pt: Arquivo "{} " não encontrado!

source: Lexicon Error
pt: Erro Léxico

source: Character "{}" unexpected --> Line: {} | Column: {}
pt: Caractere \"{} \" inesperado --> Linha: {} | Coluna: {}

source: Incompatible Python version
pt: Versão incompatível do Python

source: This file requires version 3.6 or higher. Version detected in the system: {}
pt: Este arquivo requer a versão 3,6 ou superior. Versão detectada no sistema: {}

source: Character: {} | Column: {} | Line: {} | Actual State (Before transition): {}
pt: Caractere: {} | Coluna: {} | Linha: {} | Estado Atual (Antes da transição): {}

source: Starting String...
pt: Iniciando String...

source: Ending String...
pt: Finalizando String...

source: Character: {} | Actual State (After transition): {}
pt: Caractere: {} | Estado Atual (Após a transição): {}

source: Code parsed!
pt: Código analisado!

source: List of detected Tokens
pt: Lista de tokens detectados
