Repository: VictorBrugnago/Compilador
Catalog: FooCompiler/locales/*/LC_MESSAGES/*_syntactic.po
Languages: pt

source: (transition def) Test Transition --> Non Terminal: {} | Terminal: {}
pt: (transition def) Teste Transição --> Não Terminal: {} | Terminal: {}

source: (transition def) Grammar id: %s
pt: (transition def) Id Gramática: %s

source: Unstacking...
pt: Desempilhando...

source: NonTerminal symbol on top of stack: %s
pt: Símbolo NÃO TERMINAL no topo da pilha: %s

source: Dequeuing...
pt: Desfileirando...

source: Terminal symbol queued: %s
pt: Símbolo TERMINAL no começo da fila: %s

source: SyntaxError: unexpected '{}', invalid character on line {} column {}
pt: SyntaxError: inesperado '{}', caractere inválido na linha {} coluna {}

source: SyntaxError: unexpected '{}', expecting '{}' on line {} column {}
pt: SyntaxError: inesperado '{}', era esperado '{}' na linha {} coluna {}

source: Grammar id: %s
pt: Id Gramática: %s

source: Grammar: %s
pt: Gramática: %s

source: Sentence recognized: {} -> {}
pt: Sentença reconhecida: {} -> {}

source: Error --> Stack or Queue are not empty
pt: Error --> Pilha ou Fila não estão vazias
